{
  "quiz": {
    "sort": [
      "Bubble, Selection, Insertion Sort 중에 하나를 쓴다면 무엇을 쓸것이며 그 이유는 무엇인가요?",
      "Bubble, Selection, Insertion Sort의 속도를 비교해 주시고, 값의 정렬 여부에 따라 성능의 차이가 있는지 설명해주세요.",
      "Quick Sort와 Merge Sort를 비교해 주세요.",
      "퀵정렬과 머지소트를 캐시 성능을 비교하여 설명하시오",
      "Quick Sort에서 O(N^2)이 걸리는 예시를 들고, 이를 개선할 수 있는 방법에 대해 설명해 주세요.",
      "Stable Sort가 무엇이고, 어떤 정렬 알고리즘이 Stable 한지 설명해 주세요.",
      "Merge Sort를 재귀를 사용하지 않고 구현할 수 있을까요?",
      "Radix Sort에 대해 설명해 주세요.",
      "본인이 사용하고 있는 언어에선, 어떤 정렬 알고리즘을 사용하여 정렬 함수를 제공하고 있을까요?",
      "정렬해야 하는 데이터는 50G 인데, 메모리가 4G라면, 어떤 방식으로 정렬을 진행할 수 있을까요?",
      "정렬해야 되는 대상의 각 원소가 작업단위(용량)이 큰경우 어떤 방식으로 정렬을 진행할 수 있을까요?"
    ],
    "data_structure": [
      "일반 배열과, 링크드 리스트를 비교해 주세요.",
      "링크드 리스트를 사용해서 구현할 수 있는 다른 자료구조에 대해 설명해 주세요.",
      "스택 2개로 큐를, 큐 2개로 스택을 만드는 방법과, 그 시간복잡도에 대해 설명해 주세요.",
      "시간복잡도를 유지하면서, 배열로 스택과 큐를 구현할 수 있을까요?",
      "Deque는 어떻게 구현할 수 있을까요?",
      "값이 주어졌을 때, 어떻게 하면 충돌이 최대한 적은 해시 함수를 설계할 수 있을까요?",
      "해시값이 충돌했을 때, 어떤 방식으로 처리할 수 있을까요?",
      "본인이 사용하는 언어에서는, 어떤 방식으로 해시 충돌을 처리하나요?",
      "Double Hashing 의 장점과 단점에 대해서 설명하고, 단점을 어떻게 해결할 수 있을지 설명해 주세요.",
      "이진탐색트리에서 중위 탐색을 하게 되면, 그 결과는 어떤 의미를 가지나요?",
      "이진탐색트리의 주요 연산에 대한 시간복잡도를 설명하고, 왜 그런 시간복잡도가 도출되는지 설명해 주세요.",
      "이진탐색트리의 한계점에 대해 설명해주세요.",
      "이진탐색트리의 값 삽입, 삭제 방법에 대해 설명하고, 어떤식으로 값을 삽입하면 편향이 발생할까요?",
      "힙을 배열로 구현한다고 가정하면, 어떻게 값을 저장할 수 있을까요?",
      "힙의 삽입, 삭제 방식에 대해 설명하고, 왜 이진탐색트리와 달리 편향이 발생하지 않는지 설명해 주세요.",
      "힙 정렬의 시간복잡도는 어떻게 되나요? Stable 한가요?,",
      "배열의 길이를 알고 있다면, 조금 더 빠른 Thread Safe 한 연산을 만들 순 없을까요?",
      "사용하고 있는 언어의 자료구조는 Thread Safe 한가요? 그렇지 않다면, Thread Safe 한 Wrapped Data Structure 를 제공하고 있나요?,",
      "이진탐색에서 Lower Bound, Upper Bound 는 무엇이고, 이를 어떻게 구현할 수 있을까요?,",
      "이진탐색의 논리를 적용하여 삼진탐색을 작성한다고 가정한다면, 시간복잡도는 어떻게 변화할까요? (실제 존재하는 삼진탐색 알고리즘은 무시하세요!)",
      "기존 이진탐색 로직에서 부등호의 범위가 바뀐다면, (ex. <= 라면 <로, <이라면 <= 로) 결과가 달라질까요?",
      "B-tree와 B+tree에 대해 설명하고, 데이터베이스 인덱스에서 B+Tree를 사용하는 이유를 설명해주세요",
      "춘식이가 만든 채팅 시스템에서 클라이언트들이 욕설필터링 시스템을 만들어 달라고 요구했습니다. 춘식이는 어떤 자료형을 사용하여 욕설 필터링 시스템을 만들 수 있을까요?",
      "사칙연산과 괄호가 있는 계산기를 만드려 합니다. 어떤 자료구조를 사용하여 연산을 진행할 수 있을지 설명해보세요",
      "선착순으로 한줄로 서있는 줄을 세개의 줄로 나누려고 한다. 어떻게 나누어야 고객이 불만을 가지지 않게 나눌 수 있을까?"
    ]
  }
}